Repository: 84000/data-translation-memory
Catalog: toh431-v1.tmx
Source language: bo
Languages: en

source: ཨོྃ་ན་མོ་བྷ་ག་བ་ཏེ་ཤྲཱི་ཙཎྜ་མ་ཧཱ་རོ་ཥ་ཎ་ཡ་དེ་ཝཱ་སུ་ར། མ་ནུ་ཥྱ་ཏྲཱ་ས་ནཱ་ཡ། ས་མ་སྟ་མཱ་ར་བ་ལ། པི་ནཱ་ཤ་ནཱ་ཡ། རཏྣ་མུ་ཀུ་ཊ་ཀྲྀ་ཏ་ཤི་ར་སེ་ཨི་མཾ། བ་ལི་གྲྀཧྞ་གྲྀཧྞ་མ་མ་སརྦྦ་བིགྷྣཾ། ཧ་ར་ཧ་ར། ཙ་ཏུརྨཱ་རཱནྣི་པཱ་ར་ཡ་ནི་པཱ་ར་ཡ། ཏྲཱ་ས་ཏྲཱ་ས། བྷྲཱ་མ་བྷྲཱ་མ། ཙྪིནྡ་ཙྪིནྡ། བྷིནྡ་བྷིནྡ་ནཱ་ཤ་ནཱ་ཤ། ཏཱ་པ་ཏཱ་པ། ཤ་ཥ་ཤོ་ཥ། ཙྪེདི་ཙྪེད། བྷེ་ད་བྷེ་ད། དུཥྚ་སཏྲཱཾ། མ་མ་བི་རུ་ཌྡྷ་ཙིཏྟ་ཀཾ་བྷ་སྨཱིཾ་ཀུ་རུ་ཀུ་རུ། ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: Oṁ , homage to the blessed lord Caṇḍa­mahā­roṣaṇa, to him who frightens the gods, demigods, and humans, to him who destroys the entire army of māras, to him whose head is adorned with a jewel crest! Take this oblation, take! Kill all my obstacle makers, kill! Restrain the Four Māras, restrain! Frighten, frighten! Shake, shake! Chop, chop! Break, break! Destroy, destroy! Burn, burn! Wither, wither! Split, split! Smash the evil beings that obstruct my thoughts, smash! Turn them into ashes, turn! Phaṭ , phaṭ ! Svāhā

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས་སྔགས་ཀྱི་རིམ་པར་ཕྱེ་བ་སྟེ་ལྔ་པའོ།
en: This concludes the chapter on mantras, the fifth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero .” Chapter 6 Completion Stage

source: དེ་ནས་བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དམ་དུ་འཁྱུད་ནས།
en: Then the goddess Prajñāpāramitā embraced the lord tightly,

source: པདྨ་དང་རྡོ་རྗེ་རབ་ཏུ་སྦྱོར་བས་གསུངས་པ།
en: rubbing her lotus against his vajra, and said:

source: བསྒོམ་པར་བྱ་བ་ཅི་འདྲ་ཞིག །
en: “How should one meditate

source: རྫོགས་པའི་རིམ་པའི་སྦྱོར་བ་ཡི། །
en: According to the practice of the completion stage?

source: དྲི་བ་མཐའ་དག་བཤད་དུ་གསོལ། །
en: Please elaborate on this question

source: རྣལ་འབྱོར་རྣམས་ལ་དེས་ཕན་ཕྱིར། །
en: For the good of the yoginīs.”

source: རྫོགས་པའི་རིམ་པའི་སྦྱོར་གནས་པའི།
en: “Immersed in the practice of the completion stage

source: རྣལ་འབྱོར་པ། །ཉིན་མཚན་བདག་གི་ཚུལ་གྱིས་ནི། །སེམས་རྩེ་གཅིག་པས་བསྒོམ་པར་བྱ། །
en: a yogin Should visualize my form, With one-pointed mind, day and night.

source: རེ་ཞིག་རང་གི་བུད་མེད་ཀྱང་། །ཁྱོད་ཀྱི་གཟུགས་སུ་ངེས་པར་བརྟག །
en: “He should visualize his woman In your form, incisively.

source: དེ་ཉིད་ཤིན་ཏུ་མངོན་སྦྱོར་བས། །
en: Through intensive practice like this,

source: མ་དང་བུ་མོ་དེ་ནས་ནི། །
en: “The mother, and also the daughter,

source: སྲིང་མོ་དང་ནི་ཚ་མོ་དང་། །གཞན་ཡང་ཉེ་དུ་ཀུན་དང་ནི། །
en: The younger sister, the niece, Or any other female relative,

source: དེ་བཞིན་ཌོམྦི་བྲམ་ཟེ་མོ། །
en: And likewise a female musician or a brahmin,

source: ཚོས་མ་དང་ནི་གཟུགས་ཀྱིས་འཚོ། །
en: A washerwoman, a prostitute,

source: བརྟུལ་ཞུགས་ཅན་མ་རྣལ་འབྱོར་མ། །
en: A lay vow holder, and also a yoginī,

source: དེ་བཞིན་ཐོད་པ་ཅན་མ་ཡང་། །
en: Or a female kāpālika,

source: གཞན་ཡང་ཇི་ལྟར་རྙེད་པ་ཡི། །བུད་མེད་གཟུགས་ཀྱིས་ཡང་དག་གནས། །
en: “Or another woman, as available, Well-endowed with feminine beauty—

source: ཆོ་ག་མཁས་པས་བསྟན་པར་བྱ།
en: One should make love following the prescribed way,

source: ཁྲོ་བོ་གཏུམ་པོ་ནི། །ཁྲོས་ཡས་སྒྲུབ་པ་པོ་འཇོམས་བྱེད། །
en: angry Caṇḍa­mahā­roṣaṇa Will kill the practitioner

source: མནར་མེད་པར་ཡང་ལྟུང་བར་བྱེད། །
en: And will make him fall into Avīci Hell,

source: རལ་གྲི་ཞགས་པས་འཇིགས་བྱེད་ཅན། །
en: Terrifying him with a sword and a noose.

source: འཇིག་རྟེན་འདིར་ཡང་དངོས་གྲུབ་མེད། །
en: “There will be no attainment for him in this world,

source: འཇིག་རྟེན་ཕ་རོལ་ཀྱང་དེ་བཞིན། །
en: Nor in the afterlife.

source: དེ་ཕྱིར་ཤིན་ཏུ་གསང་བ་ཡིས། །
en: Therefore one should maintain absolute secrecy

source: མཁའ་འགྲོ་མ་ཡི་སྔགས་བཞིན་
en: “Like the mantra of the ḍākinī,

source: ཁྲོ་བོ་གཏུམ་པོའི་སྒྲུབ་ཐབས་ནི། །
en: The sādhana of Caṇḍa­mahā­roṣaṇa

source: ཤིན་ཏུ་འདོད་ལྡན་དོན་གྱི་ཕྱིར། །
en: It was for the sake of insatiable lovers

source: སངས་རྒྱས་བདག་ཉིད་ཀྱིས་གསུངས་པ། །
en: That I, the Buddha, taught it.

source: བར་དུ་གཅོད་པ་ཀུན་སྤངས་པའི། །ཡིད་དང་མཐུན་པའི་ས་ཕྱོགས་སུ། །
en: “In a place pleasing to the mind, Free from all distractions,

source: རབ་ཏུ་སྦས་པས་བརྩམ་པར་བྱ། །
en: One should secretly start out with her—

source: རང་སེམས་འདོད་ལྡན་མ་དགའ་མ། །
en: The one who is pleasing to the mind.

source: ཤེས་རབ་ཕ་རོལ་ཕྱིན་དགའ་མས། །བདག་ནི་སངས་རྒྱས་མི་གཡོར་འགྲུབ། །
en: “Thinking, ‘I am the buddha Acala, A perfected being, and my beloved is Prajñāpāramitā,’

source: རང་གཟུགས་ཤིན་ཏུ་འབད་པ་ཡིས། །མཁས་པས་སེམས་ཀྱིས་བསྒོམ་པར་བྱ། །
en: The wise practitioner should visualize Their respective divine forms deeply in his mind.

source: སྐྱེ་བོས་དབེན་བྱས་གནས་སུ་ནི། །
en: “Ensuring that one’s hermitage is private

source: གཉིས་གཉིས་ཕན་ཚུན་སྦྱོར་བ་ཡིས། །རབ་ཏུ་འབད་དེ་བསྒོམ་པར་བྱ། །
en: One should meditate incisively, Engaging in the union of two lovers.

source: མི་མོ་མངོན་སུམ་བྱས་ནས་ནི། །
en: “One should place the woman in front

source: མངོན་དུ་ཕྱོགས་པས་ཉེར་འདུག་སྟེ། །
en: And make her sit facing oneself.

source: ཕན་ཚུན་གཉིས་པོ་ཆགས་པ་ཡིས། །
en: With mutual passion,

source: རབ་དགའ་ཕན་ཚུན་བལྟ་བར་བྱ། །དེ་ལས་མཐོང་བ་དེའི་བསམ་གཏན་ནི། །
en: the two Should gaze at each other intensely. “Then, focusing on the pleasure of gazing,

source: ཡིད་ནི་རྩེ་གཅིག་གནས་པར་བྱ། །
en: One should remain with one’s mind focused one-pointedly.

source: དེ་ཡིས་དེ་ལ་དེ་ཉིད་བརྗོད། །བདེ་བའི་གཟི་མདངས་བྱེད་པ་སྨྲ། །
en: At precisely that time, she should say the following words, Which bring on an intensification of pleasure:

source: དེ་ལ་བུ་ཁྱོད་བདག་གི་བདག །ཁྱོད་ནི་མིང་པོ་མེས་པོ་དང་། །
en: “ ‘You are my son, my husband; You are regarded as my brother and father.

source: བདག་ནི་ཁྱོད་ཀྱི་ཆུང་མ་མ། །སྲིང་མོ་དང་ནི་ཚ་མོ་ཡིན། །
en: I am your mother, wife, Sister, and niece.

source: སྐྱེ་བ་བདུན་རྒྱུད་ཞམ་རིང་བ། །
en: “ ‘In your seven incarnations as a man,

source: ཁྱོད་ནི་བདག་གི་གཡོག་ཡིན་ཏེ། །
en: You have been my lowly servant.

source: བདག་ནི་ཁྱོད་ཀྱི་རྗེ་དཔོན་མ། །
en: I should be regarded as your owner.’

source: རྐང་པ་དག་གི་དྲུང་བཏུད་ནས། །ཤིན་ཏུ་ཐལ་མོ་རབ་སྦྱར་ནས། །
en: “One should fall to her feet, With one’s hands joined in fervent supplication.

source: དེ་ལ་འདི་བཞིན་བརྗོད་པར་བྱ། །བདེ་བའི་གཟི་མདངས་མཆོག་བྱེད་བརྗོད། །
en: One should say at that point the supreme words That intensify the pleasure:

source: ཁྱོད་ནི་བདག་གི་ཕ་དང་མ། །བདག་གི་ཆུང་མ་ཚ་མོ་ཡིན། །
en: “ ‘You are my mother, my father’s wife. You are also my niece,

source: སྲིང་མོ་བུ་ཡི་ཆུང་མ་དང་། །
en: My younger sister, and my daughter-in-law.

source: ཁྱོད་ཀྱི་བདག་ནི་རྣམ་ཀུན་དུ། །ཤིན་ཏུ་གུས་པའི་དཔུང་གཉེན་གཡོག །
en: “ ‘I am your slave in every respect, Filled with ardent devotion.

source: བདག་ལ་སུམ་གྱི་བརྩེ་བས་གཟིགས། །
en: Please look at me with compassion,

source: མངོན་ཕྱོགས་དེ་ཡི་གདོང་བལྟས་ནས། །
en: “Looking at his face facing her,

source: བདག་གི་རྣམ་པར་སྣང་མཛད་བཟའ། །
en: ‘Eat my Vairocana,

source: ཁྱོད་ནི་མི་བསྐྱོད་ཆུ་འཐུངས་ན། །བུ་དང་ཕ་དང་བྲན་ཕོའོ། །
en: “ ‘Drink the water of Akṣobhya, O son; Be my slave as well as my father.

source: ཁྱོད་ཀྱི་རྗེ་དཔོན་མ་ཉིད་ང་། །རྒྱལ་རིགས་མ་ཡི་ཡུམ་ཉིད་ཀྱང་། །
en: For my part, I am your master And also your mother of royal descent.

source: བུ་ཁྱོད་རབ་ཏུ་འབད་པ་ཡིས། །བདག་གི་ཞབས་ལ་སྐྱབས་སུ་སོང་། །
en: “ ‘Go for refuge to my feet, O child, continually.

source: གང་ཕྱིར་བདག་ནི་འཕེལ་བྱེད་མ། །
en: Since you have been brought up by me,

source: རྡོ་རྗེ་བདེ་སྐྱེད་བདག་ལ་བྱིན། །
en: Give me the pleasure derived from the vajra!

source: ཆུ་སྐྱེས་འདབ་མ་གསུམ་པར་གཟིགས། །
en: Look at my three-petaled lotus,

source: དབུས་སུ་ཟེ་འབྲུས་བརྒྱན་པ་ཡི། །
en: Adorned in the middle with a stamen.

source: ཨ་ཧོ་བདེ་བ་ཅན་གྱི་ཞིང་། །
en: “ ‘Ah, this is the field of Sukhāvatī,

source: སངས་རྒྱས་སྐུ་མདོག་དམར་པོས་མཛེས། །
en: Adorned with the red buddha,

source: ཆགས་ཅན་ཞི་བདེ་སྟེར་མཛད་མ། །རྟོག་པ་ཐམས་ཅད་རྣམ་པར་སྤངས། །
en: Giving pleasure to impassioned lovers, Tranquil and free from all mental constructs.

source: བདག་ནི་གན་རྐྱལ་ཡང་དག་སྦྱར། །ཆགས་པས་ཡིད་ནི་རྣམ་པར་མྱོས། །
en: “ ‘As I lie on my back, Intoxicated from passion,

source: བདག་གི་སྟེང་དང་འོག་ཏུ་ལྟོས། །
en: And look me up and down.

source: དེ་ནས་རྡོ་རྗེ་རབ་སད་པས། །པད་དབུས་རན་དྷ་ར་རབ་ཏུ་གཞུག །
en: “ ‘Then you should insert your throbbing vajra Into the opening in the center of my lotus.

source: བདག་པད་འདབ་མ་གསུམ་ལྡན་པ། །ཤ་ཡིས་རབ་ཏུ་གང་ལྡན་པ། །
en: “ ‘In my three-petaled lotus, Endowed with a fleshy circle.

source: རང་གི་རྡོ་རྗེར་དེ་གཞུག་པས། །
en: You should place your vajra there

source: སེམས་ཉིད་བདེ་པས་རབ་ཏུ་མཆོད། །
en: And offer pleasure to the mind.

source: རྡོ་རྗེའི་རྩེ་མོར་རབ་ཏུ་རིག
en: Awakened by the tip of the vajra,

source: བནྡྷུ་དམར་པོ་དང་མཚུངས་པ། །
en: It is red like a bandhūka flower.’

source: ཤིན་ཏུ་མི་གཡོའི་སེམས་ཉིད་ཀྱིས། །བདེ་བ་དེ་སྐྱེས་བསྒོམ་པར་བྱ། །
en: One should meditate on the pleasure arising thence, Motionless, with the incisiveness of mind.

source: དགའ་མ་ཁྱོད་ནི་སྐད་ཅིག་སྡོད། །
en: ‘Wait a moment, my dear,

source: སྐད་ཅིག་ཙམ་ཞིག་བསམ་པར་བྱ། །
en: As I consider for a while

source: སྡིག་པའི་ལས་ལ་གནས་ཉིད་མུ་ཅོར་སྨྲ་བ་ཞེ་སྡང་བ་ལས་འདི་ནི་སྨོད་པར་བྱེད། །
en: “ ‘The foul-mouthed ones, steeped in evil acts, Who out of enmity, revile, in this world,

source: དེ་ལ་ཡུམ་གྱུར་གཅིག་ཉིད་ངེས་པར་འགྲོ་བ་གསུམ་རྣམས་ཞི་དང་བདེ་བའི་མ་མ་དེ། །
en: A woman, the sole mother of the three worlds, A gentle giver of true pleasure,

source: ལུས་ནི་ལན་མང་མེ་ཡིས་སྲེག་ཅིང་ངུ་འབོད་དུ་ནི་བསྐལ་བ་གསུམ་དུ་གནས་པར་བྱེད། །
en: crying, Their bodies burned by many fires, for three eons.

source: མི་མོའི་ཡོན་ཏན་གང་བརྗོད་ན། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་འཛིན། །
en: “ ‘On the other hand, women’s virtue, Which embraces all beings, should be spoken of—

source: ཇི་སྙེད་བརྩེ་དང་བསྲུང་བ་དང་། །
en: Be it the compassion or the protectiveness,

source: མི་མོའི་སེམས་ཉིད་ལ་རབ་གནས། །རང་གཞན་སྐྱེ་བ་དེ་སྙེད་ཀྱང་། །ཀུན་ཀྱང་དེ་ལ་ཡང་ཡང་རྒྱས། །དཔལ་གྱི་རྡོ་རྗེ་རྣལ་འབྱོར་མ། །གལ་ཏེ་དེ་གཟུགས་ལས་གཞན་མིན། །
en: Which is established in their minds. “ ‘Whether one is a friend or a stranger, She nourishes one with alms. If she has such nature, The woman is no other than Vajrayoginī.

source: དེ་ཡི་ལྟ་དང་རེག་པ་དང་། །
en: “ ‘Be it her sight, her touch,

source: ཉེད་པ་ཀུན་ནས་རིང་ཞོག་གི། །གང་ཞིག་དྲན་པ་ཙམ་གྱིས་ཀྱང་། །
en: or her caress By a mere remembrance of her When she is far away,

source: སྐད་ཅིག་དེ་ལ་བདེ་བ་འཐོབ། །
en: At that moment, pleasure is obtained.

source: ཡུལ་ལྔ་རྣམས་ལ་མི་མོ་ཡི། །
en: “ ‘The five objects of senses, as found in women,

source: ཡོན་ཏན་དམ་པ་ཀུན་གྱིས་བརྒྱན། །
en: Adorned with all good qualities,

source: བསོད་ནམས་བསོད་ནམས་བསོད་ནམས་ཆེ། །
en: Virtuous, virtuous, of great virtue,

source: ཡུམ་གྱིས་བདག་ལ་བཀའ་དྲིན་མཛོད། །
en: Be gracious to me, O mother!’

source: དེ་ནས་དེ་ལ་ཤིན་ཏུ་བལྟས། །
en: “Then, gazing intensely at her,

source: མཆུ་ནི་སོ་ཡིས་བསྡམ་པར་བྱ། །
en: One should bite one’s lower lip with one’s teeth.

source: དེ་ཡི་གོས་བྲལ་རྣལ་འབྱོར་པས། །
en: The yogin should undress her.

source: པུས་མོ་བཟུང་ལ་དེ་ཉིད་བཅིང་། །
en: The position holding the knees

source: བཅིང་པ་བརླ་ཉེད་པ་ཡང་ཡིན།
en: And the position rubbing the thighs

source: བཅིང་པ་ས་ལ་གནོན་པར་བྱ།
en: And the position pressing the ground

source: དེ་བཞིན་ཉིད་དུ་རུས་སྦལ་བཅིང་། །
en: Similarly the tortoise position,

source: ཀུན་ནས་བཟང་པོ་དེ་བཞིན་ཉིད། །
en: And the one called good in every respect

source: དཔུང་པ་ཟུང་གིས་ཕྲག་པ་ལ། །དེ་ལ་དམ་དུ་སྦྱར་བར་བྱ།
en: One should make her clasp her arms Firmly around one’s shoulders.

source: རང་གི་ལག་པ་ཟུང་དག་དེའི། །རྐེད་པའི་དབུས་སུ་ཉེར་སོན་ཏེ། །
en: “One should extend one’s own arms To the middle of her waist

source: པདྨ་ར་རྡོ་རྗེ་རབ་བཅུག་ནས། །
en: insert one’s vajra into her lotus—

source: བདེ་བ་འབྱུང་བའི་བཅིང་པར་གྲགས། །
en: This position is called the arising of pleasure

source: དེ་ཡི་པུས་གཉིས་རང་གི་ནི། །སྙིང་ག་ཉིད་དུ་ཡང་དག་སྦྱར། །
en: “One should put her knees, joined together, Against one’s chest,

source: འདི་ནི་པུས་མོ་བཟུང་ནས་བཅིང་། །
en: This position is called holding the knees

source: དེ་ཡི་རྐང་མཐིལ་རང་ཉིད་ཀྱི། །བརླ་ཡི་ཁར་ཡང་སྦྱར་བར་བྱ། །
en: “One should put the soles of her feet Against the base of one’s thighs,

source: འདི་ནི་བརླ་ཉེད་བཅིང་པའོ། །
en: This position is called the kneading of the thighs

source: བཅིང་པ་འདི་ནི་རྐང་པས་སྤྱོད། །
en: This position is called moving the feet

source: དེ་ཡི་འཕོངས་གཉིས་ས་ལ་བཞག །
en: “One should place her buttocks on the ground,

source: བཅིང་བ་འདི་ནི་ས་ལ་མནན། །
en: This position is called pressing the ground

source: རྐང་པ་གཉིས་པོ་རབ་བརྐྱང་བྱ། །
en: One should make her extend her two feet.

source: རེ་རེ་ཞིང་ཡང་བརྐྱང་བར་བྱ། །
en: One should make her extend them one at a time.

source: བཅིང་འདི་ཙི་ཏྲ་ཅན་ཞེས་བྱ། །
en: This position is called variegated

source: སླར་ཡང་བདེ་བ་འབྱུང་བྱས་ནས། །
en: Having again assumed the position of the arising of pleasure

source: ལག་པ་གཡས་པས་དེ་ཉིད་དུ། །པདྨར་རྡོ་རྗེ་ངེས་གཞུག་བྱ། །
en: “And with one’s right hand, one should Insert one’s vajra into the lotus.

source: དེ་ཡི་པུས་མོའི་འོག་བཟུང་ནས། །
en: Holding her under her knees,

source: གྲུ་ཁུགས་སྟེང་དུ་སྦྱར་བར་བྱ། །
en: One should push one’s elbows upward.

source: དེ་ཡི་རྐང་པ་ཟུང་དག་ནི། །ཕྲག་པའི་སྟེང་དུ་ངེས་པར་བྱིན། །
en: When one puts her two feet Firmly on one’s shoulders—

source: བཅིང་བ་འདི་ནི་འཁྲུལ་འཁོར་ཞོན། །
en: “This position is called mounted on a device

source: དེ་ཡི་རྐང་གཡོན་ཕྲག་པ་ལ། །གཡས་གཡོན་བརླ་ཡི་རྩ་བ་ལས། །
en: With her left foot on one’s shoulder, And the right foot at the base of one’s left thigh,

source: འདིར་ནི་རྐང་པ་སྟེང་བཅིངས་པས། །
en: This position is called with the feet upward

source: ཡང་དག་བདེ་བས་སྡུག་བསྔལ་འཇོམས། །
en: It offers genuine pleasure and dispels suffering.

source: དེ་ཡི་རྐང་པའི་མཐིལ་ལ་ནི། །བྲང་གི་དབུས་སུ་མཉམ་དུ་སྦྱར། །
en: “One should place the soles of her feet Evenly in the middle of one’s chest,

source: ལག་པ་གཉིས་ཀྱིས་བཅིར་པར་བྱ། །པུས་མོ་རུས་སྦལ་བཅིང་བར་གསུངས། །
en: And should press with one’s arms against her knees— This is called tortoise position.

source: དེ་ཡི་རྐང་པའི་མཐིལ་ལ་ནི། །མིག་དང་རྣ་བ་མགོ་བོ་སྦྱར། །
en: “One should place the soles of her feet On one’s eyes, ears, and head—

source: བཅིང་བ་འདི་ནི་ཀུན་དུ་བཟང་།
en: This position is called good in every respect

source: འདོད་ཀུན་བདེ་བ་རབ་ཏུ་སྟེར། །
en: It gives complete sexual satisfaction.

source: ཇི་སྲིད་འདོད་པས་ཡང་ནས་ཡང་། །དེ་ཡི་ཁ་ལ་འོ་བྱའོ། །
en: “One should kiss her mouth For as long as one likes, again and again;

source: ཇི་ལྟར་འདོད་ཚིག་སྨྲ་བ་ཡི། །
en: Saying sweet nothings of one’s choice.

source: དེ་ཡི་ཁ་ནས་བྱུང་བའང་བཏུང་། །
en: And drink the saliva produced in her mouth.

source: སོ་ཡི་དྲི་མའང་ཟ་ཞིང་འཇིབ། །
en: One should eat the gunk licked off her teeth,

source: བདེ་བར་རྣམ་པར་བསྒོམ་པར་བྱ། །
en: Cultivating the feeling of pleasure.

source: ལྕེ་ཡིས་སྣ་ཡི་བུ་ག་དང་། །མིག་གི་ཟུར་ཀྱང་སྤྱང་པར་བྱ། །
en: With one’s tongue, one should clean Her nostrils and the corners of her eyes.

source: སོ་དང་མཆན་ཁུང་ལས་བྱུང་བའི། །དྲི་མ་ཀུན་ཀྱང་བཟའ་བར་བྱ། །
en: “Also her teeth and her armpits— One should eat all the filth produced there.

source: ལག་པས་ནུ་མ་མཉེ་བྱ་ཞིང་། །སོ་ཡང་གདབ་ཅིང་འཇིབ་པར་བྱ། །
en: One should rub the nipples with one’s hand, Then suck and bite them.

source: བདག་གིས་སྔོན་ནས་འདི་ཉིད་ནི། །ཡང་དང་ཡང་ནི་དྲན་པར་བྱ། །
en: Recollecting again and again, ‘I was in this very place before.’

source: པདྨར་ལག་པས་རེག་པར་བྱ། །
en: “One should touch her lotus with one’s hand,

source: རླུང་གིས་མཛེས་པ་ཞེས་སྨྲ་བ།
en: While saying, ‘O wind, this is beautiful.’

source: དེ་ལ་འོ་དང་སེན་མོ་སྦྱིན། །
en: One should give kisses and rub her there with one’s fingers;

source: བལྟ་ཞིང་ལག་པས་བསལ་བར་བྱ། །
en: Then, taking one’s hand away, one should look at it.

source: མི་མོའི་དྲི་མ་མནམ་བྱ་ཞིང་། །བུ་གའང་རོ་འཛིན་གྱིས་སྤྱད་བྱ། །
en: “Smelling the scent, one should clean The woman’s orifice with one’s tongue.

source: ཇི་ལྟ་བར་ནི་བདག་ཞུགས་ནས། །འདི་ཡིས་ཀྱང་ནི་དང་ག་མེད་བསྐྱེད། །
en: ‘As I have entered through this, So also have I emerged many times.’

source: དེ་ཉིད་མི་ཤེས་སྦྱོར་བ་ཡི།
en: If applied without knowledge,

source: འགྲོ་བ་དྲུག་ཏུ་འཇུག །
en: Will lead to the six destinies.

source: སྦྱོར་བ་རབ་ཏུ་ཤེས་པ་ཡིས། །ཁྲོ་བོ་གཏུམ་པོའི་དངོས་གྲུབ་འགྱུར། །
en: “However, if applied with knowledge It will lead to the accomplishment of Caṇḍa­mahā­roṣaṇa.

source: དེ་ཕྱིར་བད་བྱུང་དཀར་དམར་ནི། །ཁ་ཡིས་དགུག་པར་བྱས་ནས་ནི། །
en: One should eat the semen or blood that is in the lotus.

source: སེན་མོ་ལེགས་བྱས་བརླ་དང་ནི། །བྲན་བཞིན་རྐང་པ་མཉེ་བར་བྱ། །
en: One should scratch her thighs with fingernails And rub her feet like a slave.

source: མགོ་བོར་ཡི་གེ་གསུམ་སྦྱིན་བྱ། །སྙིང་དབུས་ཁུ་ཚུར་ཆུང་ངུས་སྦྱིན། །
en: “One should place the three syllables on her head And give a light blow with a fist on her chest.

source: ཡིད་ནི་རྩེ་གཅིག་བདེ་བ་ཡིས། །འདོད་པའི་བྱ་བ་དེ་ལ་སྦྱིན། །
en: “One should intently pay attention there, With the mind focused one-pointedly on pleasure.

source: ཇི་ལྟར་འདོད་པ་རབ་འཛག་པས། །འཕོ་མེད་ཡིད་ནི་རྩེ་གཅིག་བདེ། །
en: One may ejaculate or not, as one pleases, With the mind focused solely on pleasure.

source: འཕོས་གྱུར་པདྨ་ལས་འཇིབ་སྟེ། །
en: “If one does ejaculate, one should lick the lotus,

source: པུས་བཙུགས་རབ་ཏུ་སྦྱོར་བ་ཡིས། །པདྨར་ཁུ་བ་རྡུལ་གྱུར་པ། །ལྕེ་ཡིས་བླངས་ནས་བཟའ་བར་བྱ། །
en: Falling down to one’s knees. One should consume the semen and the blood That are in the lotus using one’s tongue.

source: སྣ་ཡིས་ན་ལི་རབ་སྦྱོར་བས། །སྟོབས་ནི་འཕེལ་ཕྱིར་བཏུང་བར་བྱ། །
en: “One should drink these substances through one’s nose, Using a straw, in order to increase one’s power.

source: འཁྱུད་བྱས་དེ་ཡི་ཕྱི་ནས་ནི། །ཤ་དང་ཉ་ནི་བཟའ་བྱ་ཞིང་།
en: “Having embraced her, one should later Eat fish and meat.

source: འོ་མ་ཆང་ནི་ཡང་ཡང་བཏུང་། །འདོད་པས་རབ་ཏུ་འཕེལ་འགྱུར་ཕྱིར། །
en: One should drink milk or wine In order to make one’s desire arise again.

source: སླར་ཡང་སྔོན་མའི་རིམ་པ་ཡི། །གཉིས་གཉིས་ཕན་ཚུན་རབ་ཏུ་བརྩམ། །
en: Again, by the method previously described, One should start the union.

source: གོམས་པའི་སྦྱོར་བ་འདི་ཡིས་ནི། །བདེ་བ་ཆེན་པོ་བསྒྲུབ་པར་བྱ། །
en: “By doing this practice, Great bliss is attained.

source: སྐྱེ་བར་འདི་ཉིད་སྦྱོར་རིག་ན། །ཁྲོ་བོ་གཏུམ་པོའི་གོ་འཕང་འཛིན། །
en: One who knows this practice attains, In this very birth, the level of Caṇḍa­mahā­roṣaṇa.

source: བདག་གིས་སྦྱོར་བ་རབ་བཤད་བྱ། །
en: “I have taught this practice

source: ཆགས་ཅན་དངོས་གྲུབ་དོན་གྱི་ཕྱིར། །
en: In order to grant accomplishment to the passionate ones.

source: གཡོན་པའི་བྱིན་པ་སྟེང་བཞག་ནས། །གཡས་པའི་བྱིན་པ་རོལ་པར་བྱ། །
en: One should place the right shin, with ease, Above the left shin—

source: འདི་ནི་སེམས་དཔའི་སྐྱིལ་ཀྲུང་གྲགས། །
en: “This is called sattvaparyaṅka posture;

source: པདྨའི་སྐྱིལ་ཀྲུང་བཅིངས་ནས་ནི། །
en: Assuming the lotus posture,

source: བྱིན་པ་གཡོན་པ་སྟེང་དུ་དགོད། །བྱིན་པ་གཡས་པ་རོལ་པ་སྟེ། །
en: One should extend, above one’s left shin, “With ease, one’s right shin—

source: རྡོ་རྗེའི་སྐྱིལ་ཀྲུང་ཞེས་བྱར་ཤེས། །
en: This is known as vajra posture

source: རྐང་པ་ས་ལ་བཞག་ནས་ནི། །མཚུངས་པར་རིང་དུ་གདོང་ཕྱོགས་པ། །
en: One should place the soles of one’s feet on the ground, Each in the same way, parallel—

source: འདོད་ཀུན་རབ་ཏུ་སྦྱིན་ཤེས་བྱ། །འདིར་ནི་ཙོག་པུའི་གདན་ལ་ནི། །
en: “This posture, known to give complete sexual satisfaction, Is called the squatting posture

source: རྐང་པ་ས་ལ་དགོད་བྱས་ལ། །དཀྱོག་པོར་འཕྲེད་ལ་རིང་དུ་བྱ། །
en: One should place the soles of one’s feet on the ground, With the feet at an oblique angle, extended sideways

source: ཟླ་བ་ཕྱེད་པར་ཤེས་པར་བྱ། །འདིས་ནི་བདེ་བ་རབ་ཏུ་སྟེར། །
en: “This is known as the half-moon posture ; It gives complete sexual satisfaction.

source: པུས་བཟུང་འཕྲེད་ལ་ས་ལ་བཞག །
en: One should place both knees flatly on the ground,

source: ལོང་བུའི་དབུས་སུ་འཕོངས་ཚོས་བཞག
en: With the buttocks between the ankles—

source: འདིར་ནི་གཞུ་ཡི་གདན་བྱས་པས། །
en: “This is called bow posture

source: འདོད་པ་མཆོག་གི་དགའ་བ་སྟེར། །
en: It gives heavenly sexual pleasure.

source: སེམས་དཔའི་སྐྱིལ་ཀྲུང་དེ་བཞིན་དུ། །རྡོ་རྗེའི་སྐྱིལ་ཀྲུང་ཞེས་བྱར་བརྟག །
en: Sattva , lotus , and vajra Are considered postures.

source: ཙོག་པུ་ཟླ་བ་ཕྱེད་པ་དང་། །གཞུ་ཡི་གདན་ཡང་འདིར་འདོད་དོ། །
en: Squatting , half-moon , and bow Are regarded as seats.

source: ཟླ་བ་ཕྱེད་པའི་གདན་གནས་པ། །རྟག་ཏུ་མི་མོ་བྱས་ནས་ནི། །
en: One should make the woman sit in the half-moon posture, And then, without pausing,

source: ལྷུང་ན་པདྨར་ལྕེ་ཡིས་བླང་། །
en: “Fall down and lick her lotus,

source: གསང་གནས་ཡི་གེ་གསུམ་མཚོན་བྱ། །
en: Marking the three syllables on her secret place.

source: སླར་ཡང་གཞུ་ཡི་གདན་བྱས་ནས། །
en: Having again made her assume the bow posture,

source: དེས་བསྐྱེད་བདེ་བ་བསྒོམ་པར་བྱ། །
en: One should meditate on the thence-derived pleasure,

source: ཁྲོ་བོ་གཏུམ་པོ་སྦྱོར་བ་ཡིས། །
en: As this is the practice of Caṇḍa­mahā­roṣaṇa.

source: རྣམ་པར་རྟོག་པ་ཀུན་སྤངས་ནས། །
en: Free from all mental constructs.

source: ཆགས་བྲལ་སེམས་ནི་སྤང་བྱས་ལ། །
en: One should make one’s mind free from indifference

source: མ་ལ་རབ་ཏུ་འདོད་པར་བྱ། །
en: And make love to the mother.

source: རྗེས་སུ་ཆགས་ལས་བསོད་ནམས་འཐོབ།
en: “Merit is acquired through passionate affection;

source: ཆགས་བྲལ་ལས་ནི་སྡིག་པ་འཐོབ། །
en: Sins are acquired by indifference.

source: ཆགས་བྲལ་ལས་ནི་སྡིག་གཞན་མེད། །
en: There is no greater evil than the absence of passion,

source: བདེ་ལས་བསོད་ནམས་གཞན་པ་མེད། །
en: And no merit greater than pleasure.

source: དེ་ཕྱིར་སེམས་ཉིད་མཉམ་བཞག་ནས། །འདོད་པའི་བདེ་བ་བསྐྱེད་པར་བྱ། །
en: “One should therefore focus one’s mind On the pleasure arising from desire.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་མ་ཐུགས་རབ་ཏུ་དགྱེས་ནས་མངོན་པར་དགའ་བས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ། །
en: The goddess rejoiced in her heart, paid homage to and saluted the lord,

source: འདི་སྐད་དུ་ཡང་གསོལ་པ།
en: saying:

source: ཀྱེ་བཅོམ་ལྡན་འདས་ཅི་སྟེ་འདིར་འདི་ཉིད་མི་རྣམས་འབའ་ཞིག་གི་སྒྲུབ་པའི་ཐབས་ཡིན་ནམ།
en: “O lord, is this means of accomplishment exclusively for humans, or

source: གཞན་རྣམས་ཀྱི་ཡང་ཡིན།
en: is it also for other beings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The lord said:

source: ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་གནས་པས་འདི་ལ་རྗེས་སུ་ཆགས་པར་བྱ་སྟེ།
en: “Those who are impassioned with affection, Who reside in all quarters of the universe—

source: ལྷ་དང་། ལྷ་མ་ཡིན་དང་། མི་དང་། ཀླུ་དང་།
en: Gods, demigods, humans, nāgas—

source: དེ་རྣམས་ཀྱིས་ཀྱང་བསྒྲུབས་པས་འགྲུབ་བོ། །
en: They also succeed as practitioners.”

source: དེ་ཉིད་ཐོས་ནས་དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པའི་ལྷ་རྣམས།
en: When Śiva and other gods heard this,

source: གོོ་རི་དང་། དཔལ་མོ་དང་། དབང་མོ་དང་། དགའ་མོ་ལ་སོགས་པའི་ལྷ་མོ་རྣམས་བླངས་ནས་བསྒོམ་པར་རྩོམ་མོ། །
en: they grasped Gaurī, Lakṣmī, Śacī, Ratī, and other goddesses, and started to meditate.

source: དེ་ནས་དེའི་སྐད་ཅིག་ལ་དེ་ཐམས་ཅད་དེའི་སྐད་ཅིག་ཐང་ཅིག་དེ་ཉིད་ལ་ཁྲོ་བོ་གཏུམ་པོའི་གོ་འཕང་ཐོབ་ནས།
en: At that moment, all of them instantaneously attained the level of Caṇḍa­mahā­roṣaṇa and

source: སའི་སྟེང་དུ་སྤྱོད་པར་གྱུར་ཏོ། །
en: began to wander on the earth.

source: དེ་ལ་དབང་ཕྱུག་ཆེན་པོ་རྡོ་རྗེ་བདེ་བྱེད་ཉིད་དུ་གྲུབ་བོ། །
en: Among them, Śiva became accomplished as Vajraśaṃkara;

source: ལྷའི་དབང་པོ་ཕྱག་ན་རྡོ་རྗེ་ཉིད་དོ། །
en: Indra as Vajrapāṇi;

source: འདོད་པའི་ལྷ་ཡན་ལག་མེད་པའི་རྡོ་རྗེ་ཉིད་དོ། །
en: Kāmadeva as Vajrānaṅga.

source: དེ་ལྟ་བུ་ལ་སོགས་པའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པའི་ལྷའི་བུ་རྣམས་ཀྱིས་གྲུབ་བོ། །
en: In this way, the main gods, as numerous as grains of sand in the Ganges, became accomplished.

source: འདོད་པའི་ཡོན་ཏན་ལྔ་ལྡན་ཉིད། །
en: Endowed with the qualities of the five sensual desires,

source: སེམས་ཅན་དོན་ཀུན་སྒྲུབ་པ་པོ། །
en: Fulfilling the aims of all beings,

source: འབྱུང་པོ་སྣ་ཚོགས་གཟུགས་འཛིན་པ། །
en: All possessed of different forms—

source: སྒྱུ་མ་ཀུན་ལས་རྣམ་པར་རྒྱལ། །
en: They are victors adept in magic.

source: ཇི་ལྟར་འདམ་ལས་བྱུང་བ་ཡི། །པདྨ་འདམ་གྱིས་གོས་པ་མེད། །
en: Just as a lotus, growing out of mud, Is not soiled by dirt or mud,

source: དེ་ལྟར་འདོད་ཆགས་ལས་བྱུང་བའི། །
en: So also they, arisen through experiencing passion,

source: ཉེས་པ་རྣམས་ཀྱིས་གོས་པ་མེད།
en: Are not soiled by faults.

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔའ་ཁྲོ་བོ་གཏུམ་པོའི་རྒྱུད་ལས་རྫོགས་པའི་རིམ་པའི་རྣལ་འབྱོར་རིམ་པར་ཕྱེ་བ་སྟེ་དྲུག་པའོ།། །
en: This concludes the chapter on the practice of the completion stage, the sixth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero
